def part4_1():
    a = [1, 2, 3, 4, 5]
    print(a[0], a[3], a[:3])


part4_1()


def part4_2():
    a = ['Ростов', '+', 'на', '-', 'Дону']
    a[1] = '-'
    print(a[0] + a[1] + a[2] + a[3] + a[4])


part4_2()


def part4_3():
    a = ['Ростов', '+', 'на', '-', 'Дону']
    a[1] = '-'
    print(a[0] + a[1] + a[2] + a[3] + a[4])


part4_3()


def part4_4():
    a = ['Ростов', '+', 'на', '-', 'Дону']
    a[1] = '-'
    a = a[:-1]
    print(*reversed(a))


part4_4()


def part4_5():
    a = ['a', 's', '1', 'a', '32', '23']
    b = set(a)
    print(b)


# Множество удаляет дубликаты

part4_5()
